namespace SGS29.ComponentBasedArchitecture
{
    /// <summary>
    /// Інтерфейс для об'єктів, які можуть обробляти значення типу <typeparamref name="V"/>.
    /// Цей інтерфейс визначає контракт для компонентів або класів, які мають виконувати операцію обробки значення певного типу.
    /// </summary>
    /// <typeparam name="V">
    /// Тип значення, яке буде оброблятися.
    /// Це може бути будь-який тип даних, наприклад, числові значення, рядки або складні об'єкти.
    /// </typeparam>
    public interface IHandling<V>
    {
        /// <summary>
        /// Метод для обробки значення.
        /// Використовується для виконання логіки обробки і повернення результату обробки.
        /// </summary>
        /// <returns>
        /// Повертає результат обробки, який має тип <typeparamref name="V"/>.
        /// Це може бути нове значення або зміна наявного значення в залежності від контексту обробки.
        /// </returns>
        V Handle();
    }
}